Revit 2027 API
LinePatternElement.GetLinePattern Method
 Gets the LinePattern associated to this element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinePattern GetLinePattern()
Public Function GetLinePattern As LinePattern
public:
LinePattern^ GetLinePattern()
member GetLinePattern : unit -> LinePattern
Return Value
LinePattern
 A copy of LinePattern object.
See Also
Reference
LinePatternElement Class
GetLinePattern Overload
Autodesk.Revit.DB Namespace